#### Terraform Plan 📖
<details><summary>Show Plan</summary>

```terraform
[command]/home/runner/work/_temp/9e4f082e-0a92-4d92-9656-e3854c71fd97/terraform-bin plan -out=tfplan -no-color
module.db.module.db_instance.random_id.snapshot_identifier[0]: Refreshing state... [id=3ECwjw]
module.ecr.data.aws_caller_identity.current: Reading...
module.ecr.data.aws_partition.current: Reading...
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.db.module.db_instance.data.aws_partition.current: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-05686e7dc52f8f6df]
module.db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=aidoctors-db-20251029151831188300000001]
module.db.module.db_instance.aws_cloudwatch_log_group.this["postgresql"]: Refreshing state... [id=/aws/rds/instance/aidoctors-db/postgresql]
module.db.module.db_instance.aws_cloudwatch_log_group.this["upgrade"]: Refreshing state... [id=/aws/rds/instance/aidoctors-db/upgrade]
module.db.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecr.data.aws_partition.current: Read complete after 0s [id=aws]
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
module.db.module.db_instance.aws_iam_role.enhanced_monitoring[0]: Refreshing state... [id=aidoctors-rds-monitoring-role]
module.ecr.data.aws_caller_identity.current: Read complete after 0s [id=521538197756]
module.ecr.data.aws_iam_policy_document.repository[0]: Reading...
module.ecr.data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=1578471098]
module.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0]: Refreshing state... [id=aidoctors-rds-monitoring-role/arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole]
module.rds_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-03ed752e073dfbab3]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-083c0db3e1395fded]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0fc63c4d494374dd6]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-073019d7ba4d1ac80]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0032386130964171e]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-043f4c0120570ae34]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0f7d82a180ace47f4]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0c5b5757a4ad55762]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-07efa2bcb551685bd]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-07bf335ed55e1233f]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0bf70d3f2fadcfb41]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-00181454359ad7fee]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0f5eb680acf65fea3]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-09431dd1309dfe33a]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-038f6ff47eba184f5]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-030857cf79d386198]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0f7d82a180ace47f41080289494]
module.rds_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3263409970]
module.rds_security_group.aws_security_group_rule.egress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3542370404]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=aidoctors-vpc]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-073ba5a5e32dc7574]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-061c36c6e2b02f39c]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-060bb021411c4af84]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0c43d4e8b4f48b114]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0bbaf291468d476f3]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08ce7f62a5a36df2c]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-060795adfd71d2087]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0e24a561bd9bff913]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0f5eb680acf65fea31080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-09431dd1309dfe33a1080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.ecr.aws_ecr_lifecycle_policy.this[0] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 5 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 5
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Remove untagged images after 7 days"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber = 7
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + region      = "us-east-2"
      + registry_id = (known after apply)
      + repository  = "aidoctors-app"
    }

  # module.ecr.aws_ecr_repository.this[0] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "aidoctors-app"
      + region               = "us-east-2"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name" = "aidoctors-ecr"
        }
      + tags_all             = {
          + "Name" = "aidoctors-ecr"
        }

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr.aws_ecr_repository_policy.this[0] will be created
  + resource "aws_ecr_repository_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:ListTagsForResource",
                          + "ecr:ListImages",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:GetLifecyclePolicyPreview",
                          + "ecr:GetLifecyclePolicy",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:DescribeRepositories",
                          + "ecr:DescribeImages",
                          + "ecr:DescribeImageScanFindings",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::521538197756:root"
                        }
                      + Sid       = "PrivateReadOnly"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region      = "us-east-2"
      + registry_id = (known after apply)
      + repository  = "aidoctors-app"
    }

  # module.db.module.db_instance.aws_db_instance.this[0] will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + allow_major_version_upgrade           = false
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 7
      + backup_target                         = (known after apply)
      + backup_window                         = "03:00-06:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + database_insights_mode                = (known after apply)
      + db_name                               = "aidoctors-db"
      + db_subnet_group_name                  = "aidoctors-vpc"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = true
      + domain_fqdn                           = (known after apply)
      + enabled_cloudwatch_logs_exports       = [
          + "postgresql",
          + "upgrade",
        ]
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_lifecycle_support              = "open-source-rds-extended-support-disabled"
      + engine_version                        = "17.6"
      + engine_version_actual                 = (known after apply)
      + final_snapshot_identifier             = "final-aidoctors-db-dc40b08f"
      + hosted_zone_id                        = (known after apply)
      + iam_database_authentication_enabled   = true
      + id                                    = (known after apply)
      + identifier                            = "aidoctors-db"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t4g.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = "mon:00:00-mon:03:00"
      + manage_master_user_password           = true
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + max_allocated_storage                 = 50
      + monitoring_interval                   = 60
      + monitoring_role_arn                   = "arn:aws:iam::521538197756:role/aidoctors-rds-monitoring-role"
      + multi_az                              = true
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password_wo                           = (write-only attribute)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 5432
      + publicly_accessible                   = false
      + region                                = "us-east-2"
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = false
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "Name" = "aidoctors-postgres"
        }
      + tags_all                              = {
          + "Name" = "aidoctors-postgres"
        }
      + timezone                              = (known after apply)
      + username                              = "aidoctors_admin"
      + vpc_security_group_ids                = [
          + "sg-03ed752e073dfbab3",
        ]

      + timeouts {}
    }

  # module.db.module.db_instance.aws_secretsmanager_secret_rotation.this[0] will be created
  + resource "aws_secretsmanager_secret_rotation" "this" {
      + id                 = (known after apply)
      + region             = "us-east-2"
      + rotate_immediately = false
      + rotation_enabled   = (known after apply)
      + secret_id          = (known after apply)

      + rotation_rules {
          + schedule_expression = "rate(30 days)"
        }
    }

  # module.db.module.db_parameter_group.aws_db_parameter_group.this[0] must be replaced
+/- resource "aws_db_parameter_group" "this" {
      ~ arn          = "arn:aws:rds:us-east-2:521538197756:pg:aidoctors-db-20251029151831188300000001" -> (known after apply)
      ~ family       = "postgres15" -> "postgres17" # forces replacement
      ~ id           = "aidoctors-db-20251029151831188300000001" -> (known after apply)
      ~ name         = "aidoctors-db-20251029151831188300000001" -> (known after apply)
        tags         = {
            "Name" = "aidoctors-db"
        }
        # (5 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 6 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + db_instance_master_user_secret_arn = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
::debug::Terraform exited with code 0.
::debug::stdout: module.db.module.db_instance.random_id.snapshot_identifier[0]: Refreshing state... [id=3ECwjw]%0Amodule.ecr.data.aws_caller_identity.current: Reading...%0Amodule.ecr.data.aws_partition.current: Reading...%0Amodule.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...%0Amodule.db.module.db_instance.data.aws_partition.current: Reading...%0Amodule.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-05686e7dc52f8f6df]%0Amodule.db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=aidoctors-db-20251029151831188300000001]%0Amodule.db.module.db_instance.aws_cloudwatch_log_group.this["postgresql"]: Refreshing state... [id=/aws/rds/instance/aidoctors-db/postgresql]%0Amodule.db.module.db_instance.aws_cloudwatch_log_group.this["upgrade"]: Refreshing state... [id=/aws/rds/instance/aidoctors-db/upgrade]%0Amodule.db.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]%0Amodule.ecr.data.aws_partition.current: Read complete after 0s [id=aws]%0Amodule.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]%0Amodule.db.module.db_instance.aws_iam_role.enhanced_monitoring[0]: Refreshing state... [id=aidoctors-rds-monitoring-role]%0Amodule.ecr.data.aws_caller_identity.current: Read complete after 0s [id=521538197756]%0Amodule.ecr.data.aws_iam_policy_document.repository[0]: Reading...%0Amodule.ecr.data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=1578471098]%0Amodule.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0]: Refreshing state... [id=aidoctors-rds-monitoring-role/arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole]%0Amodule.rds_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-03ed752e073dfbab3]%0Amodule.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-083c0db3e1395fded]%0Amodule.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0fc63c4d494374dd6]%0Amodule.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-073019d7ba4d1ac80]%0Amodule.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0032386130964171e]%0Amodule.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-043f4c0120570ae34]%0Amodule.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0f7d82a180ace47f4]%0Amodule.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0c5b5757a4ad55762]%0Amodule.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-07efa2bcb551685bd]%0Amodule.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-07bf335ed55e1233f]%0Amodule.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0bf70d3f2fadcfb41]%0Amodule.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-00181454359ad7fee]%0Amodule.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0f5eb680acf65fea3]%0Amodule.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-09431dd1309dfe33a]%0Amodule.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-038f6ff47eba184f5]%0Amodule.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-030857cf79d386198]%0Amodule.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0f7d82a180ace47f41080289494]%0Amodule.rds_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3263409970]%0Amodule.rds_security_group.aws_security_group_rule.egress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3542370404]%0Amodule.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=aidoctors-vpc]%0Amodule.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-073ba5a5e32dc7574]%0Amodule.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-061c36c6e2b02f39c]%0Amodule.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-060bb021411c4af84]%0Amodule.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0c43d4e8b4f48b114]%0Amodule.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0bbaf291468d476f3]%0Amodule.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08ce7f62a5a36df2c]%0Amodule.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-060795adfd71d2087]%0Amodule.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0e24a561bd9bff913]%0Amodule.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0f5eb680acf65fea31080289494]%0Amodule.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-09431dd1309dfe33a1080289494]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A+/- create replacement and then destroy%0A%0ATerraform will perform the following actions:%0A%0A  # module.ecr.aws_ecr_lifecycle_policy.this[0] will be created%0A  + resource "aws_ecr_lifecycle_policy" "this" {%0A      + id          = (known after apply)%0A      + policy      = jsonencode(%0A            {%0A              + rules = [%0A                  + {%0A                      + action       = {%0A                          + type = "expire"%0A                        }%0A                      + description  = "Keep last 5 images"%0A                      + rulePriority = 1%0A                      + selection    = {%0A                          + countNumber   = 5%0A                          + countType     = "imageCountMoreThan"%0A                          + tagPrefixList = [%0A                              + "v",%0A                            ]%0A                          + tagStatus     = "tagged"%0A                        }%0A                    },%0A                  + {%0A                      + action       = {%0A                          + type = "expire"%0A                        }%0A                      + description  = "Remove untagged images after 7 days"%0A                      + rulePriority = 2%0A                      + selection    = {%0A                          + countNumber = 7%0A                          + countType   = "sinceImagePushed"%0A                          + countUnit   = "days"%0A                          + tagStatus   = "untagged"%0A                        }%0A                    },%0A                ]%0A            }%0A        )%0A      + region      = "us-east-2"%0A      + registry_id = (known after apply)%0A      + repository  = "aidoctors-app"%0A    }%0A%0A  # module.ecr.aws_ecr_repository.this[0] will be created%0A  + resource "aws_ecr_repository" "this" {%0A      + arn                  = (known after apply)%0A      + force_delete         = true%0A      + id                   = (known after apply)%0A      + image_tag_mutability = "IMMUTABLE"%0A      + name                 = "aidoctors-app"%0A      + region               = "us-east-2"%0A      + registry_id          = (known after apply)%0A      + repository_url       = (known after apply)%0A      + tags                 = {%0A          + "Name" = "aidoctors-ecr"%0A        }%0A      + tags_all             = {%0A          + "Name" = "aidoctors-ecr"%0A        }%0A%0A      + encryption_configuration {%0A          + encryption_type = "AES256"%0A          + kms_key         = (known after apply)%0A        }%0A%0A      + image_scanning_configuration {%0A          + scan_on_push = true%0A        }%0A    }%0A%0A  # module.ecr.aws_ecr_repository_policy.this[0] will be created%0A  + resource "aws_ecr_repository_policy" "this" {%0A      + id          = (known after apply)%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = [%0A                          + "ecr:ListTagsForResource",%0A                          + "ecr:ListImages",%0A                          + "ecr:GetRepositoryPolicy",%0A                          + "ecr:GetLifecyclePolicyPreview",%0A                          + "ecr:GetLifecyclePolicy",%0A                          + "ecr:GetDownloadUrlForLayer",%0A                          + "ecr:GetAuthorizationToken",%0A                          + "ecr:DescribeRepositories",%0A                          + "ecr:DescribeImages",%0A                          + "ecr:DescribeImageScanFindings",%0A                          + "ecr:BatchGetImage",%0A                          + "ecr:BatchCheckLayerAvailability",%0A                        ]%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + AWS = "arn:aws:iam::521538197756:root"%0A                        }%0A                      + Sid       = "PrivateReadOnly"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + region      = "us-east-2"%0A      + registry_id = (known after apply)%0A      + repository  = "aidoctors-app"%0A    }%0A%0A  # module.db.module.db_instance.aws_db_instance.this[0] will be created%0A  + resource "aws_db_instance" "this" {%0A      + address                               = (known after apply)%0A      + allocated_storage                     = 20%0A      + allow_major_version_upgrade           = false%0A      + apply_immediately                     = false%0A      + arn                                   = (known after apply)%0A      + auto_minor_version_upgrade            = true%0A      + availability_zone                     = (known after apply)%0A      + backup_retention_period               = 7%0A      + backup_target                         = (known after apply)%0A      + backup_window                         = "03:00-06:00"%0A      + ca_cert_identifier                    = (known after apply)%0A      + character_set_name                    = (known after apply)%0A      + copy_tags_to_snapshot                 = false%0A      + database_insights_mode                = (known after apply)%0A      + db_name                               = "aidoctors-db"%0A      + db_subnet_group_name                  = "aidoctors-vpc"%0A      + dedicated_log_volume                  = false%0A      + delete_automated_backups              = true%0A      + deletion_protection                   = true%0A      + domain_fqdn                           = (known after apply)%0A      + enabled_cloudwatch_logs_exports       = [%0A          + "postgresql",%0A          + "upgrade",%0A        ]%0A      + endpoint                              = (known after apply)%0A      + engine                                = "postgres"%0A      + engine_lifecycle_support              = "open-source-rds-extended-support-disabled"%0A      + engine_version                        = "17.6"%0A      + engine_version_actual                 = (known after apply)%0A      + final_snapshot_identifier             = "final-aidoctors-db-dc40b08f"%0A      + hosted_zone_id                        = (known after apply)%0A      + iam_database_authentication_enabled   = true%0A      + id                                    = (known after apply)%0A      + identifier                            = "aidoctors-db"%0A      + identifier_prefix                     = (known after apply)%0A      + instance_class                        = "db.t4g.micro"%0A      + iops                                  = (known after apply)%0A      + kms_key_id                            = (known after apply)%0A      + latest_restorable_time                = (known after apply)%0A      + license_model                         = (known after apply)%0A      + listener_endpoint                     = (known after apply)%0A      + maintenance_window                    = "mon:00:00-mon:03:00"%0A      + manage_master_user_password           = true%0A      + master_user_secret                    = (known after apply)%0A      + master_user_secret_kms_key_id         = (known after apply)%0A      + max_allocated_storage                 = 50%0A      + monitoring_interval                   = 60%0A      + monitoring_role_arn                   = "arn:aws:iam::521538197756:role/aidoctors-rds-monitoring-role"%0A      + multi_az                              = true%0A      + nchar_character_set_name              = (known after apply)%0A      + network_type                          = (known after apply)%0A      + option_group_name                     = (known after apply)%0A      + parameter_group_name                  = (known after apply)%0A      + password_wo                           = (write-only attribute)%0A      + performance_insights_enabled          = false%0A      + performance_insights_kms_key_id       = (known after apply)%0A      + performance_insights_retention_period = (known after apply)%0A      + port                                  = 5432%0A      + publicly_accessible                   = false%0A      + region                                = "us-east-2"%0A      + replica_mode                          = (known after apply)%0A      + replicas                              = (known after apply)%0A      + resource_id                           = (known after apply)%0A      + skip_final_snapshot                   = false%0A      + snapshot_identifier                   = (known after apply)%0A      + status                                = (known after apply)%0A      + storage_encrypted                     = true%0A      + storage_throughput                    = (known after apply)%0A      + storage_type                          = (known after apply)%0A      + tags                                  = {%0A          + "Name" = "aidoctors-postgres"%0A        }%0A      + tags_all                              = {%0A          + "Name" = "aidoctors-postgres"%0A        }%0A      + timezone                              = (known after apply)%0A      + username                              = "aidoctors_admin"%0A      + vpc_security_group_ids                = [%0A          + "sg-03ed752e073dfbab3",%0A        ]%0A%0A      + timeouts {}%0A    }%0A%0A  # module.db.module.db_instance.aws_secretsmanager_secret_rotation.this[0] will be created%0A  + resource "aws_secretsmanager_secret_rotation" "this" {%0A      + id                 = (known after apply)%0A      + region             = "us-east-2"%0A      + rotate_immediately = false%0A      + rotation_enabled   = (known after apply)%0A      + secret_id          = (known after apply)%0A%0A      + rotation_rules {%0A          + schedule_expression = "rate(30 days)"%0A        }%0A    }%0A%0A  # module.db.module.db_parameter_group.aws_db_parameter_group.this[0] must be replaced%0A+/- resource "aws_db_parameter_group" "this" {%0A      ~ arn          = "arn:aws:rds:us-east-2:521538197756:pg:aidoctors-db-20251029151831188300000001" -> (known after apply)%0A      ~ family       = "postgres15" -> "postgres17" # forces replacement%0A      ~ id           = "aidoctors-db-20251029151831188300000001" -> (known after apply)%0A      ~ name         = "aidoctors-db-20251029151831188300000001" -> (known after apply)%0A        tags         = {%0A            "Name" = "aidoctors-db"%0A        }%0A        # (5 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0APlan: 6 to add, 0 to change, 1 to destroy.%0A%0AChanges to Outputs:%0A  + db_instance_master_user_secret_arn = (known after apply)%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tfplan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tfplan"%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Pusher: @TerryTian21, Action: `pull_request`, Workflow: `Terraform PR Check`*